{
  "fetch_timestamp": "2025-09-16T03:06:11.873631Z",
  "shop_domain": "tgaqpq-w2.myshopify.com",
  "data_type": "collections",
  "total_collections": 94,
  "collections": [
    {
      "collection_id": "gid://shopify/Collection/660658979147",
      "title": "White Noise Machines",
      "handle": "white-noise-machines",
      "description": "Mask distracting sounds and create a consistent, soothing audio environment. Our collection of white noise and sound machines helps you fall asleep faster and stay asleep longer."
    },
    {
      "collection_id": "gid://shopify/Collection/660659011915",
      "title": "Blackout Curtains",
      "handle": "blackout-curtains",
      "description": "Create the perfect, dark sanctuary for sleep. Our collection of blackout curtains is designed to block external light, reduce noise, and insulate your room for optimal rest."
    },
    {
      "collection_id": "gid://shopify/Collection/660659044683",
      "title": "Sleep Masks",
      "handle": "sleep-masks",
      "description": "Achieve total darkness for uninterrupted, deeper sleep. Our collection of sleep masks is curated for maximum comfort and light-blocking effectiveness."
    },
    {
      "collection_id": "gid://shopify/Collection/660724875595",
      "title": "Pillow & Sleep Sprays",
      "handle": "pillow-sleep-sprays",
      "description": "Discover our complete collection of sleep sprays, expertly blended to calm the mind and create a serene atmosphere conducive to deep, restorative sleep."
    },
    {
      "collection_id": "gid://shopify/Collection/660725006667",
      "title": "Smart Sound Machines (App-Controlled)",
      "handle": "smart-sound-machines-app-controlled",
      "description": "Take control of your sound environment. Our smart sound machines connect to your phone via an app, allowing you to control the sound, volume, and set timers remotely."
    },
    {
      "collection_id": "gid://shopify/Collection/660725924171",
      "title": "Portable & Travel Sound Machines",
      "handle": "portable-travel-sound-machines",
      "description": "Ensure a good night's sleep wherever you are. Our compact and rechargeable portable sound machines are perfect for travel, the office, or for babies in their pram."
    },
    {
      "collection_id": "gid://shopify/Collection/660726022475",
      "title": "White Noise Machines for Babies",
      "handle": "white-noise-machines-for-babies",
      "description": "Help your baby fall asleep and stay asleep by mimicking the soothing sounds of the womb. Our baby sound machines are a must-have for any nursery."
    },
    {
      "collection_id": "gid://shopify/Collection/660726055243",
      "title": "White Noise Machines for Adults",
      "handle": "white-noise-machines-for-adults",
      "description": "Mask distracting noises and calm a racing mind. Our white noise machines for adults feature a range of soothing sounds, from pure white noise to gentle nature scapes."
    },
    {
      "collection_id": "gid://shopify/Collection/660726120779",
      "title": "Travel Blackout Blinds",
      "handle": "travel-blackout-blinds",
      "description": "Turn any room into a dark sleep space. Our portable travel blackout blinds use suction cups to temporarily attach to any window, perfect for holidays and visiting family."
    },
    {
      "collection_id": "gid://shopify/Collection/660726153547",
      "title": "Children's & Nursery Blackout Curtains",
      "handle": "childrens-nursery-blackout-curtains",
      "description": "Essential for nap times. Our children's blackout curtains come in a range of soft colours and gentle patterns to create a dark, soothing environment for your little one's sleep."
    },
    {
      "collection_id": "gid://shopify/Collection/660726284619",
      "title": "Blackout Roller Blinds",
      "handle": "blackout-roller-blinds",
      "description": "A sleek, minimalist solution for total darkness. Our blackout roller blinds fit snugly within your window frame to eliminate light leakage for perfect daytime sleep or movie nights."
    },
    {
      "collection_id": "gid://shopify/Collection/660726317387",
      "title": "Thermal Blackout Curtains",
      "handle": "thermal-blackout-curtains",
      "description": "Block light, insulate your room, and reduce noise. Our thermal blackout curtains are a triple-threat for creating the ultimate sleep environment, keeping your room dark and comfortable."
    },
    {
      "collection_id": "gid://shopify/Collection/660726382923",
      "title": "Travel Sleep Masks",
      "handle": "travel-sleep-masks",
      "description": "An essential for any journey. Our travel sleep masks are lightweight, compact, and come with a convenient pouch to ensure you can find rest on planes, trains, and in hotels."
    },
    {
      "collection_id": "gid://shopify/Collection/660726448459",
      "title": "Blackout & Contoured Masks",
      "handle": "blackout-contoured-masks",
      "description": "For 100% darkness. Our contoured sleep masks are designed with hollow eye cups that block all light without putting any pressure on your eyelids, protecting your lashes."
    },
    {
      "collection_id": "gid://shopify/Collection/660726513995",
      "title": "Weighted Sleep Masks",
      "handle": "weighted-sleep-masks",
      "description": "Gentle, calming pressure for your eyes. Our weighted sleep masks use microbeads to provide gentle pressure that can help relieve tension and deepen relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/660726546763",
      "title": "Silk Sleep Masks",
      "handle": "silk-sleep-masks",
      "description": "Indulge in the ultimate sleep luxury. Our 100% mulberry silk sleep masks are incredibly soft on your skin, block out light, and help prevent sleep creases."
    },
    {
      "collection_id": "gid://shopify/Collection/660726808907",
      "title": "Pillow Mists",
      "handle": "pillow-mists",
      "description": "A nightly ritual for tranquility. Our specially formulated pillow mists are designed to be sprayed directly onto your pillow to envelop you in a calming aroma as you sleep."
    },
    {
      "collection_id": "gid://shopify/Collection/660727038283",
      "title": "Eucalyptus & Mint Sprays",
      "handle": "eucalyptus-mint-sprays",
      "description": "Refresh your space and clear your mind with our invigorating eucalyptus and mint sprays. Ideal for creating a clean, calming environment conducive to restful breathing."
    },
    {
      "collection_id": "gid://shopify/Collection/660727136587",
      "title": "Chamomile Sleep Sprays",
      "handle": "chamomile-sleep-sprays",
      "description": "Gently drift off with the soft, comforting scent of chamomile. Our chamomile sleep sprays are perfect for creating a serene and tranquil atmosphere in your bedroom."
    },
    {
      "collection_id": "gid://shopify/Collection/660727398731",
      "title": "Room & Linen Sprays",
      "handle": "room-linen-sprays",
      "description": "Transform your entire bedroom into a sanctuary for sleep. Our versatile room and linen sprays can be used on bedding, curtains, and in the air to create a lasting sense of calm."
    },
    {
      "collection_id": "gid://shopify/Collection/660727562571",
      "title": "Travel-Size Sleep Sprays",
      "handle": "travel-size-sleep-sprays",
      "description": "Take tranquility with you. Our travel-size sleep sprays are perfectly sized for your luggage, helping you create a familiar sense of calm and routine wherever you go."
    },
    {
      "collection_id": "gid://shopify/Collection/660727693643",
      "title": "Lavender Sleep Sprays",
      "handle": "lavender-sleep-sprays",
      "description": "Unwind and prepare for deep rest with our calming lavender sleep sprays. Made with natural essential oils to help soothe the mind and promote a peaceful night's sleep."
    },
    {
      "collection_id": "gid://shopify/Collection/665885081931",
      "title": "Weighted Blankets",
      "handle": "weighted-blankets",
      "description": "Embrace the feeling of a gentle, comforting hug. Our curated collection of weighted blankets uses deep pressure stimulation to help calm the nervous system, reduce anxiety, and promote deeper, more restorative sleep. Explore our range by user, weight, or feature to find your perfect match."
    },
    {
      "collection_id": "gid://shopify/Collection/665885278539",
      "title": "Pillows",
      "handle": "pillows",
      "description": "The right pillow is the foundation of a good night's sleep. Our curated collection of pillows is designed to provide optimal support for your head and neck, promoting proper spinal alignment and relieving pressure. Explore our range to find the perfect pillow for your unique sleeping style and comfort preferences."
    },
    {
      "collection_id": "gid://shopify/Collection/666361200971",
      "title": "Sleep Environment",
      "handle": "sleep-environment",
      "description": "Your environment is the foundation of a good night's sleep. This curated collection features all the essentials you need to master your surroundings. Take control of light, sound, and scent to transform your bedroom into the perfect, peaceful sanctuary for deep and uninterrupted rest."
    },
    {
      "collection_id": "gid://shopify/Collection/666361692491",
      "title": "Relaxation Aids for Sleep",
      "handle": "relaxation-aids",
      "description": "Struggle to switch off your mind at night? This collection is dedicated to calming a racing mind and soothing the body to ease the transition into sleep. Discover our natural, sensory-based solutions for reducing stress and anxiety, and find your path to a tranquil night."
    },
    {
      "collection_id": "gid://shopify/Collection/666362708299",
      "title": "Tools for Deeper Sleep",
      "handle": "deep-sleep-tools",
      "description": "Waking up tired is often a sign of poor sleep quality. This collection features our most effective tools for achieving deeper, more restorative, and uninterrupted sleep. Block out disruptions and support your body's natural sleep cycle to wake up feeling truly refreshed and energised."
    },
    {
      "collection_id": "gid://shopify/Collection/666413105483",
      "title": "Sleep aids for better rest",
      "handle": "sleep-aids-for-better-rest",
      "description": "Discover our curated collection of sleep aids for better rest. Transform your sleep experience with science-backed products designed for deep, restorative rest."
    },
    {
      "collection_id": "gid://shopify/Collection/666413138251",
      "title": "Sleep wellness essentials",
      "handle": "sleep-wellness-essentials",
      "description": "Discover our curated collection of sleep wellness essentials. Transform your sleep experience with science-backed products designed for deep, restorative rest."
    },
    {
      "collection_id": "gid://shopify/Collection/666413171019",
      "title": "Natural sleep improvement products",
      "handle": "natural-sleep-improvement-products",
      "description": "Discover our curated collection of natural sleep improvement products. Transform your sleep experience with science-backed products designed for deep, restorative rest."
    },
    {
      "collection_id": "gid://shopify/Collection/666413203787",
      "title": "Sleep quality improvement tools",
      "handle": "sleep-quality-improvement-tools",
      "description": "Discover our curated collection of sleep quality improvement tools. Transform your sleep experience with science-backed products designed for deep, restorative rest."
    },
    {
      "collection_id": "gid://shopify/Collection/666413236555",
      "title": "Christmas gifts for better sleep",
      "handle": "christmas-gifts-for-better-sleep",
      "description": "Perfect christmas gifts for better sleep for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413269323",
      "title": "Black Friday sleep wellness deals",
      "handle": "black-friday-sleep-wellness-deals",
      "description": "Perfect black friday sleep wellness deals for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413302091",
      "title": "Birthday gifts for sleep lovers",
      "handle": "birthday-gifts-for-sleep-lovers",
      "description": "Perfect birthday gifts for sleep lovers for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413334859",
      "title": "Mother's Day self care sleep gifts",
      "handle": "mothers-day-self-care-sleep-gifts",
      "description": "Perfect mother's day self care sleep gifts for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413367627",
      "title": "Wedding registry sleep essentials",
      "handle": "wedding-registry-sleep-essentials",
      "description": "Perfect wedding registry sleep essentials for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413400395",
      "title": "Valentine's Day couples sleep gifts",
      "handle": "valentines-day-couples-sleep-gifts",
      "description": "Perfect valentine's day couples sleep gifts for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413433163",
      "title": "Cyber Monday relaxation gifts",
      "handle": "cyber-monday-relaxation-gifts",
      "description": "Perfect cyber monday relaxation gifts for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413465931",
      "title": "Father's Day stress relief gifts",
      "handle": "fathers-day-stress-relief-gifts",
      "description": "Perfect father's day stress relief gifts for anyone who values quality sleep. Curated selection of premium sleep wellness products that make meaningful, thoughtful presents."
    },
    {
      "collection_id": "gid://shopify/Collection/666413498699",
      "title": "Insomnia relief products",
      "handle": "insomnia-relief-products",
      "description": "Specialized insomnia relief products designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413531467",
      "title": "Sleep aids for depression and anxiety",
      "handle": "sleep-aids-for-depression-and-anxiety",
      "description": "Specialized sleep aids for depression and anxiety designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413564235",
      "title": "Sleep aids for shift workers",
      "handle": "sleep-aids-for-shift-workers",
      "description": "Specialized sleep aids for shift workers designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413597003",
      "title": "Anxiety sleep support tools",
      "handle": "anxiety-sleep-support-tools",
      "description": "Specialized anxiety sleep support tools designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413629771",
      "title": "Stress relief sleep products",
      "handle": "stress-relief-sleep-products",
      "description": "Specialized stress relief sleep products designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413662539",
      "title": "Light sleeper solutions",
      "handle": "light-sleeper-solutions",
      "description": "Specialized light sleeper solutions designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413695307",
      "title": "Sleep solutions for apartment living",
      "handle": "sleep-solutions-for-apartment-living",
      "description": "Specialized sleep solutions for apartment living designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    },
    {
      "collection_id": "gid://shopify/Collection/666413728075",
      "title": "Sleep gifts for new parents",
      "handle": "sleep-gifts-for-new-parents",
      "description": "High-quality sleep gifts for new parents for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666413760843",
      "title": "Sleep aids for busy professionals",
      "handle": "sleep-aids-for-busy-professionals",
      "description": "Tailored sleep aids for busy professionals designed for specific lifestyle needs. Carefully selected sleep wellness products that fit seamlessly into your daily routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666413793611",
      "title": "Student dorm sleep essentials",
      "handle": "student-dorm-sleep-essentials",
      "description": "Tailored student dorm sleep essentials designed for specific lifestyle needs. Carefully selected sleep wellness products that fit seamlessly into your daily routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666413826379",
      "title": "Senior sleep comfort solutions",
      "handle": "senior-sleep-comfort-solutions",
      "description": "Tailored senior sleep comfort solutions designed for specific lifestyle needs. Carefully selected sleep wellness products that fit seamlessly into your daily routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666413891915",
      "title": "Travel sleep aids for business trips",
      "handle": "travel-sleep-aids-for-business-trips",
      "description": "Tailored travel sleep aids for business trips designed for specific lifestyle needs. Carefully selected sleep wellness products that fit seamlessly into your daily routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666413924683",
      "title": "Hotel quality sleep at home",
      "handle": "hotel-quality-sleep-at-home",
      "description": "Elevate your sleep experience with hotel quality sleep at home. Premium products that bring luxury sleep wellness into your daily self-care routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666413957451",
      "title": "Spa day relaxation products",
      "handle": "spa-day-relaxation-products",
      "description": "Elevate your sleep experience with spa day relaxation products. Premium products that bring luxury sleep wellness into your daily self-care routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666414022987",
      "title": "Self care Sunday sleep rituals",
      "handle": "self-care-sunday-sleep-rituals",
      "description": "Elevate your sleep experience with self care sunday sleep rituals. Premium products that bring luxury sleep wellness into your daily self-care routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666414055755",
      "title": "Holiday stress relief sleep aids",
      "handle": "holiday-stress-relief-sleep-aids",
      "description": "Elevate your sleep experience with holiday stress relief sleep aids. Premium products that bring luxury sleep wellness into your daily self-care routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666414088523",
      "title": "Work from home relaxation tools",
      "handle": "work-from-home-relaxation-tools",
      "description": "Elevate your sleep experience with work from home relaxation tools. Premium products that bring luxury sleep wellness into your daily self-care routine."
    },
    {
      "collection_id": "gid://shopify/Collection/666414121291",
      "title": "Blackout sleep solutions for light sensitivity",
      "handle": "blackout-sleep-solutions-for-light-sensitivity",
      "description": "High-quality blackout sleep solutions for light sensitivity for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414154059",
      "title": "Travel sleep essentials for frequent flyers",
      "handle": "travel-sleep-essentials-for-frequent-flyers",
      "description": "High-quality travel sleep essentials for frequent flyers for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414219595",
      "title": "Sleep mask gifts for light sleepers",
      "handle": "sleep-mask-gifts-for-light-sleepers",
      "description": "High-quality sleep mask gifts for light sleepers for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414252363",
      "title": "Eye mask for meditation practice",
      "handle": "eye-mask-for-meditation-practice",
      "description": "High-quality eye mask for meditation practice for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414285131",
      "title": "Weighted eye mask for anxiety relief",
      "handle": "weighted-eye-mask-for-anxiety-relief",
      "description": "High-quality weighted eye mask for anxiety relief for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414317899",
      "title": "Aromatherapy sleep aids for relaxation",
      "handle": "aromatherapy-sleep-aids-for-relaxation",
      "description": "High-quality aromatherapy sleep aids for relaxation for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414350667",
      "title": "Lavender pillow spray for restless nights",
      "handle": "lavender-pillow-spray-for-restless-nights",
      "description": "High-quality lavender pillow spray for restless nights for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414383435",
      "title": "Natural sleep aids for bedtime routine",
      "handle": "natural-sleep-aids-for-bedtime-routine",
      "description": "High-quality natural sleep aids for bedtime routine for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414416203",
      "title": "Aromatherapy gifts for meditation lovers",
      "handle": "aromatherapy-gifts-for-meditation-lovers",
      "description": "High-quality aromatherapy gifts for meditation lovers for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414448971",
      "title": "Anxiety relief gifts for stressed students",
      "handle": "anxiety-relief-gifts-for-stressed-students",
      "description": "High-quality anxiety relief gifts for stressed students for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414481739",
      "title": "Weighted therapy for sensory comfort",
      "handle": "weighted-therapy-for-sensory-comfort",
      "description": "High-quality weighted therapy for sensory comfort for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414514507",
      "title": "Deep pressure therapy blankets for autism",
      "handle": "deep-pressure-therapy-blankets-for-autism",
      "description": "High-quality deep pressure therapy blankets for autism for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414547275",
      "title": "Therapeutic blankets for PTSD relief",
      "handle": "therapeutic-blankets-for-ptsd-relief",
      "description": "High-quality therapeutic blankets for ptsd relief for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414580043",
      "title": "Sensory processing disorder sleep aids",
      "handle": "sensory-processing-disorder-sleep-aids",
      "description": "High-quality sensory processing disorder sleep aids for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414612811",
      "title": "White noise solutions for noisy environments",
      "handle": "white-noise-solutions-for-noisy-environments",
      "description": "High-quality white noise solutions for noisy environments for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414645579",
      "title": "Baby sleep aids for new parents",
      "handle": "baby-sleep-aids-for-new-parents",
      "description": "High-quality baby sleep aids for new parents for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414678347",
      "title": "Sound masking for noisy environments",
      "handle": "sound-masking-for-noisy-environments",
      "description": "High-quality sound masking for noisy environments for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414711115",
      "title": "Meditation accessories for mindfulness practice",
      "handle": "meditation-accessories-for-mindfulness-practice",
      "description": "High-quality meditation accessories for mindfulness practice for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414743883",
      "title": "Smart home sleep automation products",
      "handle": "smart-home-sleep-automation-products",
      "description": "High-quality smart home sleep automation products for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414776651",
      "title": "Room darkening solutions for better sleep",
      "handle": "room-darkening-solutions-for-better-sleep",
      "description": "High-quality room darkening solutions for better sleep for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414809419",
      "title": "Light blocking bedroom essentials",
      "handle": "light-blocking-bedroom-essentials",
      "description": "High-quality light blocking bedroom essentials for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414842187",
      "title": "Blackout curtains for shift workers",
      "handle": "blackout-curtains-for-shift-workers",
      "description": "High-quality blackout curtains for shift workers for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414874955",
      "title": "Energy saving window treatments",
      "handle": "energy-saving-window-treatments",
      "description": "High-quality energy saving window treatments for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414907723",
      "title": "Ergonomic pillows for neck pain relief",
      "handle": "ergonomic-pillows-for-neck-pain-relief",
      "description": "High-quality ergonomic pillows for neck pain relief for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414940491",
      "title": "Memory foam pillows for better sleep",
      "handle": "memory-foam-pillows-for-better-sleep",
      "description": "High-quality memory foam pillows for better sleep for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666414973259",
      "title": "Travel pillows for business trips",
      "handle": "travel-pillows-for-business-trips",
      "description": "High-quality travel pillows for business trips for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415006027",
      "title": "Comfort pillows for side sleepers",
      "handle": "comfort-pillows-for-side-sleepers",
      "description": "High-quality comfort pillows for side sleepers for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415038795",
      "title": "Orthopedic sleep support products",
      "handle": "orthopedic-sleep-support-products",
      "description": "High-quality orthopedic sleep support products for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415071563",
      "title": "Cozy comfort gifts for winter months",
      "handle": "cozy-comfort-gifts-for-winter-months",
      "description": "High-quality cozy comfort gifts for winter months for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415104331",
      "title": "Luxury bedding for hotel quality sleep",
      "handle": "luxury-bedding-for-hotel-quality-sleep",
      "description": "High-quality luxury bedding for hotel quality sleep for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415137099",
      "title": "Soft blankets for relaxation",
      "handle": "soft-blankets-for-relaxation",
      "description": "High-quality soft blankets for relaxation for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415169867",
      "title": "Winter sleep comfort essentials",
      "handle": "winter-sleep-comfort-essentials",
      "description": "High-quality winter sleep comfort essentials for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415202635",
      "title": "Comfort blankets for stress relief",
      "handle": "comfort-blankets-for-stress-relief",
      "description": "High-quality comfort blankets for stress relief for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415235403",
      "title": "Smart alarm clocks for better wake up",
      "handle": "smart-alarm-clocks-for-better-wake-up",
      "description": "High-quality smart alarm clocks for better wake up for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415268171",
      "title": "Light therapy alarm clocks",
      "handle": "light-therapy-alarm-clocks",
      "description": "High-quality light therapy alarm clocks for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415300939",
      "title": "Sunrise simulation wake up lights",
      "handle": "sunrise-simulation-wake-up-lights",
      "description": "High-quality sunrise simulation wake up lights for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415333707",
      "title": "Sleep cycle optimization tools",
      "handle": "sleep-cycle-optimization-tools",
      "description": "High-quality sleep cycle optimization tools for enhanced sleep comfort. Browse our expert-selected range of products designed for optimal rest and relaxation."
    },
    {
      "collection_id": "gid://shopify/Collection/666415366475",
      "title": "Sleep gifts for restless nights",
      "handle": "sleep-gifts-for-restless-nights",
      "description": "Specialized sleep gifts for restless nights designed to address specific sleep challenges. Our expert-curated collection features proven solutions backed by sleep science research."
    }
  ]
}